/**
 * 
 */
package exercise06;

/**
 * @since 2017. 10. 22.
 * @author 구병국
 */
public class CalculatorDrive {

	/**
	 * Input클래스의 객체를 만들어서 첫번째수, 연산자, 두번째수를 호출한다.
	 * 연산자가 아닐경우 다시 엽력을 받는다.
	 * Caculator클래스의 객체를 만든다.
	 * 연산자의 종류에 따라 Caculator의 객체내에의 각각 메서드들을 호출한다.
	 * Output 객체를 생성하여 첫번째수, 연산자, 두번째수, 결과값을 념겨주고 출력형태 대로 출력을 한다.
	 */
//	출력형태
//	첫번째 값을 입력하시오. 5
//	연산기호를 입력하시오. *
//	두번째 값을 입력하시오. 4
//	곱셈 : 5 * 4 = 20
//	연산기호를 입력하시오. k
//	연산기호를 입력하시오. /
//	두번째 값을 입력하시오. 2
//	나눗셈 : 20 / 2 = 10
//	연산기호를 입력하시오. quit
//	최종결과값 : 10
//	계산기 끝~ 안녕!
	public static void main(String[] args) {
		

	}

}
